// import React from "react";
import "./body.css";
const Body = () => {
    return (
        <div>

            <div className="mydiv">
                تیرے قدرت کا سلامت رہے یارب
                نیک تمام کو ہمیں اک ہونے دے

                نہ ہو تو غم کسی سے گزار نہیں سکتا
                کشتی کو زندگی کا سہارا دے

                دین تو دین ہے سارا اے سنمبل خودی
                جز مرگ کو کوئی رہائی نہیں

                تجھے انسان بنا دیا ذوق نفس نے
                نفس کو نفس ہی کا کام نہیں

                اے مردِ مسلم! نہیں فقط نام تیرا
                مزاجِ خدا کا آفتاب ہے تو

                سبحان اللہ کا نشیمن ہے تو سنگین
                سرکارِ آصفہ ہو یا زر

                غالبؔ! تیری کیمیائی سخنیں
                کیا غم، دلیل، تسکیں، ہیں آخر


            </div>

            <div className="mydiv1">
                "شکوہ ہے عشق کا غم، بہر حد سے گزر گیا
                محبت کا زمانہ خواب تھا اک سحر گزر گیا

                دل کی بستی بس کہ خشبو کے پردے کا درد
                خوشبو کو ترش بنا دیا، راحت کا زر گزر گیا

                یہ وقت کہتا ہے مجھے، تیرا تصور ہوں میں
                کہ ہوں جمال تیرا خواب سا خوشنصر گزر گیا

                یہ سبزا سبزا ہے، برساتوں کا سلسبیل
                خودی کو کر کے ہر جگہ، خدا کی سرور گزر گیا

                غالبؔ اس ادائیگی کا نام نہ لینا غالب
                ہم وہاں ہیں، جہاں سے ہم کو بھی گزر گیا"


            </div>

            <div className="mydiv2">
                لب پہ آتی ہے دعا بن کے تمنا میری
                زندگی شمع کی صورت ہو خدایا میری

                میرے دل کو بھی یہ ہے تمنا میری
                میں قوتِ دل کی ترسیلِ نما میری

                دُرد بھی دینے، ہے دوا بن کے تمنا میری
                کرم کر مجھ پے اتنا کہ میں نور بن جاؤں

                بن کے رشکِ حسین، اڑنے چلی آؤں میں
                بہکی ہے انا یاس سے زندگی کو تمنا میری

                تیرا بخشنے سے ملے زندگی مجھ کو
                یا رب! دلِ مسکین کو بہی زوال نہیں

                میری کامیابی کا ہے سرور نصیب
                کہ طرح پر بن سکوں اپنی حکمت کا روشنی

                آئنے سے پوچھتا ہے مجھ سے زندگی
                کیسی ہے تری آخرت، اے زندگی

                یہی ہو نصیب میری کوئی عمر ہو
                کیسے آؤں تیری خودائی کی گلیوں میں

                مجھ سے بھی چھپ جائے ناشِ برقِ تحقیق
                اور کھل جائے چھپ کی طاقتِ بے نقصی

                زندگی کی راہوں میں کرم یا رب!
                مجھ کو زندگی کی مکمل آسانی دے



            </div>


            <div className="mydiv">
                تیرے قدرت کا سلامت رہے یارب
                نیک تمام کو ہمیں اک ہونے دے

                نہ ہو تو غم کسی سے گزار نہیں سکتا
                کشتی کو زندگی کا سہارا دے

                دین تو دین ہے سارا اے سنمبل خودی
                جز مرگ کو کوئی رہائی نہیں

                تجھے انسان بنا دیا ذوق نفس نے
                نفس کو نفس ہی کا کام نہیں

                اے مردِ مسلم! نہیں فقط نام تیرا
                مزاجِ خدا کا آفتاب ہے تو

                سبحان اللہ کا نشیمن ہے تو سنگین
                سرکارِ آصفہ ہو یا زر

                غالبؔ! تیری کیمیائی سخنیں
                کیا غم، دلیل، تسکیں، ہیں آخر


            </div>

            <div className="mydiv1">
                "شکوہ ہے عشق کا غم، بہر حد سے گزر گیا
                محبت کا زمانہ خواب تھا اک سحر گزر گیا

                دل کی بستی بس کہ خشبو کے پردے کا درد
                خوشبو کو ترش بنا دیا، راحت کا زر گزر گیا

                یہ وقت کہتا ہے مجھے، تیرا تصور ہوں میں
                کہ ہوں جمال تیرا خواب سا خوشنصر گزر گیا

                یہ سبزا سبزا ہے، برساتوں کا سلسبیل
                خودی کو کر کے ہر جگہ، خدا کی سرور گزر گیا

                غالبؔ اس ادائیگی کا نام نہ لینا غالب
                ہم وہاں ہیں، جہاں سے ہم کو بھی گزر گیا"


            </div>

            <div className="mydiv3">
                اے آسمان بتا زمین کو زندگی کیا ہے
                یہ چمکتے ہوئے تارے کیا ہیں
                ,
                دل سے جو بات نکلتی ہے، اس روز و شب و جدوں میں
                یہ افکار بھی تیری محفل کو گاؤں میں

                روزِ فطرت ہے آج میں بھی زندہ و جاں
                غیر کی فطرت کا تماشا ہو گیا

                خودی کو کر بلند اتنا کہ ہر تختیر سے پہلے
                خدا بندے سے خود پُوچھے، بتا تیری رضا کیا ہے





            </div>



        </div>
    )

};
export default Body;